In [15]:
people = {

    "first" : ["Lokesh " ,"Abhishek"],
    "last":  ["Joshi" ,"Chauhan"],
    "email": [ "lokesh2104joshi" ,"a6030"]
}

In [16]:
import pandas as pd

In [17]:
df = pd.DataFrame(people)

In [18]:
df

      first     last            email
0   Lokesh     Joshi  lokesh2104joshi
1  Abhishek  Chauhan            a6030

In [19]:
df['email']

0    lokesh2104joshi
1              a6030
Name: email, dtype: object

In [22]:
df.set_index('email' , inplace = True)  # sets the column as the index

In [23]:
df

                    first     last
email
lokesh2104joshi   Lokesh     Joshi
a6030            Abhishek  Chauhan

In [27]:
df.loc['lokesh2104joshi' , ['first','last']]

first    Lokesh
last       Joshi
Name: lokesh2104joshi, dtype: object

In [28]:
df.reset_index(inplace = True)

In [29]:
df

             email     first     last
0  lokesh2104joshi   Lokesh     Joshi
1            a6030  Abhishek  Chauhan